[
  {
    "path": "posts/2023-07-26-summer-2021-shiny-app-tutorial-fingerprint-minutiae-movement/",
    "title": "Summer 2021 Shiny App Tutorial: Fingerprint Minutiae Movement by Examiner and Print",
    "description": "A tutorial on how to use the interactive data visualization app I created during\nmy Summer 2021 research experience, which depicts fingerprint minutiae movement\nby examiner and print",
    "author": [
      {
        "name": "Sherry Huang",
        "url": {}
      }
    ],
    "date": "2023-07-26",
    "categories": [],
    "contents": "\nIntroduction\nIn this blog, I’m going to walk through how to use and understand the Shiny app\nI created during my Summer 2021 research experience. If you’re unfamiliar with\nShiny apps, they are web applications created using R where you can show your\ndata analyses and visualizations. And if you’re unfamiliar with the research I\ndid in Summer 2021, you can read my blog about it\nhere.\nFinding My Shiny App\nThere are a couple different ways to access my Shiny app: via\nthis hyperlink,\ntyping in asluby.shinyapps.io/Minutiae-Movement\ninto your search bar, or typing in bit.ly/fingerprintimputation\ninto your search bar. Regardless, they should all take you to the same place.\nScatterplot of Fingerprint Minutiae Markings\nI am not able to replicate my entire Shiny app on my website, but I will try my\nbest to replicate the visualizations found on the app. When you first open the\napp, you will see the following scatterplot:\n\n\n\nThis scatterplot displays all the markings forensic fingerprint examiners make\nwhen they examined a latent and exemplar print to determine if they are matches,\nor from the same individual, in this White Box study conducted by the FBI. Due\nto privacy reasons, we aren’t allowed to view the fingerprints the examiners\nlooked at, but if we imagine a Cartesian plane on top of the fingerprints and\nmarkings, this is exactly what the scatterplot is, just without the fingerprints.\nThe points represent the markings the examiners made in the Comparison and\nAnalysis stages. The hexagons behind the points are a way to show the density of\nmarkings in an area. A darker hexagon represents an area with a lot of markings\nacross the examiners, and a lighter hexagon represents an area with few markings.\nWe can also think of a darker hexagon as an area where many examiners agree that\nthere is a unique and notable feature, thus resulting in many markings in that\narea; similarly, a lighter hexagon is an area where there may not be many unique\nand notable features, and so few examiners mark that area. The lines represent\nany “movements” of markings between stages of examination. This is useful for my\nresearch in imputation bias, as this could provide evidence that examiners could\nbe changing markings to support their own conclusions, especially when they are\ngiven an exemplar print to examine alongside the latent print in the Comparison\nstage. The color represents minutiae markings marked in the Analysis stage in\nthis specific scatterplot. There are different characteristics of a fingerprint\nthat examiners look for and mark, such as minutiae, delta, core, etc. You can\nchange which part to highlight by selecting a feature on the left of the Shiny\napp under “Feature Type.” Note that this is not possible in the scatterplot\nshown here on my blog; this only shows the minutiae feature type. Also note that\nin some prints, there may be none of a certain feature type. And finally, you\ncan also hover your mouse over a marking to see which examiner marked it and at\nwhich stage.\nThe title of the plot includes the study’s label for the prints examined: M010003.\nThe “M” in the label lets us know that the latent and exemplar prints are indeed\nmatches in this case, and the numbers are the unique labels for the latent and\nexemplar prints.\nThus, this first scatterplot shows the markings made by several examiners (and\nhow they are moved) at two different stages of examination on a latent and\nexemplar print that are matches. If you want to look at different prints, simply\nselect a different pair from the drop-down menu at the left of the Shiny app under\n“Pair ID.” Note that this is not possible here on my blog; this only shows the\npair “M010003.” Also note that if you pick a pair that begins with “N,” the latent\nand exemplar prints are not matches in that case.\nScatterplot of Minutiae Markings by Examiner\nAbove the scatterplot on the Shiny app ( not on this blog), there are three\ntabs. Currently, the “Print” tab is selected. This is the scatterplot shown in\nthe previous section, and it shows the minutiae marked by all the examiners\nwho looked at this latent and exemplar print. However, we may be interested in\nhow each examiner marked the prints. We can do this by selecting the “Examiner”\ntab above the scatterplot.\n\n\n\nThe default scatterplot shown above displays all the same information as the\nfirst scatterplot, but instead of looking at markings by all examiners who looked\nat pair M010003, this scatterplot only displays markings by one examiner,\nspecifically examiner EA1338, on the pair M01003. Here, the hexes and line\nsegments offer more information on how each examiner marks fingerprints. For\nexample, notice that there is only one dark hexagon. This demonstrates that the\nexaminer marked minutiae in areas where few other examiners marked minutiae.\nWhile this doesn’t necessarily mean that the examiners minutiae markings can’t be\ntrusted, this could be a pattern we look for in the examiner’s other fingerprint\nmarkings. Also notice that there are only 2 line segments. This indicates that\nthe examiner rarely moved any of their markings between stages. Again, while this\ndoesn’t mean that the examiner is not susceptible to imputation bias, this is\nanother pattern we can keep in mind when looking at the examiners’ other print\nmarkings. In general, these scatterplots are a good way to get an idea of\nexaminers’ patterns when marking prints. You can change which examiner’s\nscatterplot you want to see by selecting a different examiner from the drop-down\nmenu under “Examiner ID” at the left of the Shiny app.\nThe examiners will change when you change the pair ID because different\nexaminers viewed different fingerprints in this study. Currently, there is no\ngreat way of looking at one examiner’s scatterplot across different prints. When\ndesigning this app, I chose to have it centered around being easier to compare\nmarkings across different prints, and not across one examiner.\nSummary of Print Conclusions\nThe last tab above the scatterplot on the Shiny app ( not on this blog) is\nthe “Summary” tab. This gives a table depicting the conclusions of the examiners’\nfindings in this study. Below is the summary table for the pair ID M010003.\n\n% Correct\n% No Value\n% Inconclusive\n% Change in Value\n% Very Easy\n% Easy\n% Moderate\n% Difficult\n% Very Difficult\n# Examiners\n1\n100\n0\n0\n0\n13.33\n46.67\n33.33\n6.67\n0\n15\nThe first column is simply the number of rows, which should just be \\(1\\) for every\nsummary table. The second column is the percent of examiners who got the\nconclusion correct (i.e., they correctly identified the prints as matches or\nnon-matches). In this specific summary table, \\(100\\%\\) of the examiners correctly\nidentified this pair as matches. The third column is the percent of examiners who\nidentified the print as “No Value,” which means that they felt that the latent\nprint “is not of value for individualization and contains no usable friction ridge\ninformation.” In this specific summary table, \\(0\\%\\) of the examiners identified\nthe latent print as “No Value.” The fourth column is the percent of examiners who\nwere inconclusive about their determinations. “Inconclusive” means that “[t]he\ncomparison [determined] that neither individualization nor exclusion is possible.”\nIn this specific summary table, \\(0\\%\\) of the examiners were inconclusive about\ntheir results. The fifth column is the percent of examiners who changed their\nconclusions between the analysis and comparison stages. For example, an examiner\nmight identify a latent print as “VEO,” which means that “the impression is of\nvalue for exclusion only and contains some friction ridge information that may be\nappropriate for exclusion if an appropriate exemplar is available.” However, after\nthe comparison stage, the examiner might change their conclusion to “VID,” which\nmeans “that the impression is of value and is appropriate for potential\nindividualization if an appropriate exemplar is available.” I’ve included this in\nthe summary table because this could be potential evidence of imputation bias –\nespecially with a switch from NV (No Value) or VEO (Value for Exclusion Only) to\nVID (Value for Identification) because NV/VEO means that the latent print is not\nappropriate for individualization. In this specific summary table, we can see\nthat \\(0\\%\\) of the examiners had a change in value across stages. The next five\ncolumns (columns six through ten) are the percentage of examiners who picked each\ncomparison difficulty. In this specific summary table, \\(13.33\\%\\) examiners found\nthe comparison very easy, \\(46.67\\%\\) easy, \\(33.33\\%\\) moderate, \\(6.67\\%\\) difficult,\nand \\(0\\%\\) very difficult. And finally, the last column shows the number of\nexaminers total in the study that looked at that specific latent and exemplar\nprint. In this specific summary table, \\(15\\) examiners looked at this specific\npair M010003.\nI’ve included this summary table because it gives a good birds-eye view of how\nexaminers performed on this pair of prints. For pair M010003, the general\nconclusion appears to be that it was an “easier” comparison, and every examiner\ngot it right. With other pairs, we could potentially use the table to find\nevidence of imputation bias, such as the “\\(\\%\\) Change in Value” column or “\\(\\%\\)\nCorrect” column. To view the summary table of other pairs, simply select a\ndifferent pair from the drop-down menu under “Pair ID” at the left of the Shiny\napp.\nConclusion\nThis Shiny app was designed as part of my Summer 2021 research looking at\nimputation bias in the forensic fingerprint examination process. The scatterplots\nand tables show movement and changes in minutiae markings between stages, which\nis evidence of imputation bias. In general, however, my goal was to create an\neasy, visual way to represent and understand the idea of “imputation bias.” If\nyou have any further questions, please feel free to reach out to me.\n\n\n\n",
    "preview": {},
    "last_modified": "2023-08-04T15:27:14-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-04-24-movement-of-tenants-evicted-from-buildings-with-highest-eviction-filing-rates/",
    "title": "Movement of Tenants Evicted from Buildings with Highest Eviction Filing Rates",
    "description": "An introduction to my Summer 2022 internship experience with the Eviction Lab\non better understanding eviction practices in Philadelphia, PA.",
    "author": [
      {
        "name": "Sherry Huang",
        "url": {}
      }
    ],
    "date": "2023-04-24",
    "categories": [],
    "contents": "\nIntroduction\nIn Philadelphia, 25 addresses have accounted for 8.6 percent of all eviction\nfilings in the county from 2016 to 2020. Meanwhile, other buildings in the\nneighborhood file few evictions despite serving tenants with similar socioeconomic\nbackgrounds. The two current contending theories for these “top evictor” buildings\nare: 1) abusive management or 2) buildings of last resort. Abusive management is\nthe idea that property managers may be too quick to file evictions. If, however,\n“top evictors” are serving as buildings of last resort, then the high eviction\nrates could be explained by the tenants that are selecting into these buildings.\nWhile the tenantry of top evictors may have similar socioeconomic characteristics\nas the tenantry of more stable buildings, tenant self-selection may be selecting\non observable characteristics associated with housing instability.\nThis research brief examines the mobility of renters in Philadelphia County in\nand out of these top evictor buildings since 2016. The analysis aims to understand\nwhy these buildings have such high eviction filing rates, as forced mobility is\ndisruptive and traumatizing for renters.\nData and Methods\nThis analysis makes use of the 5-year American Community Survey (ACS) data\nfrom 2015-2019 for the data sets on race, median household income, median gross\nrent, and college degree. The Eviction Lab collected data on the top 25 buildings\nand zip codes with the highest eviction filing rates in Philadelphia County, PA,\nas well as data on mobility to and from select addresses. An eviction filing refers\nto any non-commercial eviction (i.e., residential housing not occupied by a business)\ncase for which we observe a court record.\nUsing Philadelphia County census tract shapefiles\nfound on Open Data Philly, we clustered the census\ntracts by race, median household income, median gross rent, and college degree\nusing Latent Profile Analysis. Using a “VVV model” (varying volume, varying\nshape, and varying orientation) with six clusters, the model returned a lower BIC\nvalue (-7785.103) than other models and almost all other numbers of clusters.\nClustering allows us to group census tracts with similar races, incomes, rents,\nand college degrees. We then combined the clustered data with the top evictor\nbuildings (geocoded with QGIS) in order to discover if the buildings are clustered\nin a way that is different from low eviction buildings.\nTo analyze mobility flows across numerous buildings and zip codes, we incorporated\naddress data from Infutor. We identified the most recent moves before and after\nliving in a top evictor building and/or zip code from the Infutor data. We also\nfound buildings nearby with similar demographics but lower eviction rates using data.\nUsing the epiflows\npackage in R, we then created and compared network graphs for each property and\nzip code with the data. The buildings or zip codes serve as nodes, and edges\nrepresent a shared tenant. All plots can be accessed at this interactive data visualization app.\nResults\nAcross the top 25 top evictor buildings, we find that most of the top evictor\nbuildings are found in areas with lower median household income and lower percentage\nof White residents. We also find that almost all the zip codes containing top\nevictor buildings are found among the top 25 zip codes with the highest eviction\nfiling rates. Our analysis thus suggests that eviction filings are deeply linked\nwith race and poverty.\nMapping the network graphs of top evictors, “control” buildings, and zip codes\nallows us to compare general mobility patterns across the different areas.\nPreliminary research shows that the top evicting buildings’ network graphs do not\ndiffer significantly from their low-evicting neighbors. Our analysis suggests that\nbecause these network graphs do not differ, then these top evictor buildings are\nnot serving as buildings of last resort.\nWhile our analysis does not show that “abusive management” is the cause of the\nhigh eviction rates in these top evictor buildings, it is our best guess given\nthe patterns that we are seeing. Thus, the lab is following up by collaborating\nwith a team of legal aid providers, who will be doing interviews with tenants of\ntop evictor buildings to learn more about management practices there. Understanding\nwhat differentiates these top evictors from their seemingly similar neighbors\nwould give policymakers leverage in reducing the toll of mass evictions on their\ncommunities. If abusive management is in fact the case in these top evictors, then\ntop-down enforcement actions may be effective at reducing top evictors’ contribution\nto city-level eviction rates.\nAcknowledgements\nI would like to thank the Lang Center for Civic and Social Responsibility\nfor fully funding this experience and allowing me to work with the Eviction Lab.\nI would also like to thank the Eviction Lab for allowing me to intern at their\nlab this past summer. I would especially like to thank Carl Gershenson for being my\nmentor throughout this project.\nReferences\nDesmond, Matthew. Evicted: Poverty and Profit in the American City. Crown Publishers, 2016.\nDesmond, Matthew, et al. “Forced Relocation and Residential Instability among\nUrban Renters.” Social Service Review, vol. 89, no. 2, June 2015, pp. 227–262.,\nhttps://doi.org/10.1086/681091.\nBadger, Emily. “When the Best Available Home Is the One You Already Have.” The\nNew York Times, The New York Times, 27 May 2022,\nhttps://www.nytimes.com/2022/05/27/upshot/housing-market-slow-moving.html.\n\n\n\n",
    "preview": {},
    "last_modified": "2023-05-15T15:12:43-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-07-16-imputation-bias-in-forensic-fingerprint-examinations/",
    "title": "Imputation Bias in Forensic Fingerprint Examinations",
    "description": "An introduction to my Summer 2021 research with Professor Amanda Luby on\nimputation bias in minutiae markings by fingerprint examiners.",
    "author": [
      {
        "name": "Sherry Huang",
        "url": {}
      }
    ],
    "date": "2022-07-16",
    "categories": [],
    "contents": "\nIntroduction\nImputation is the process of replacing missing data with substituted values. In\nthe forensic fingerprint examination process, this bias could come in during the\nstage of comparing two potential matching prints. Examiners are shown the latent\nand exemplar prints at the same time during this stage, and there is evidence of\nminutiae movement, addition, and/or deletion during this stage. In my Summer 2021\nresearch, I explored patterns in these movements in order to identify potential\nimputation bias in the forensic fingerprint examination process.\nMethods\nIn order to explore minutiae movement across variables such as examiners, prints,\nand feature types, I created an interactive visualization app\nas part of my Summer 2021 research with Professor Amanda Luby.\nThe app allows you to select pairs of prints via the Pair ID drop-down menu. Options\ninclude mates (variables starting with “M”) and non-mates (variables starting with\n“N”). The app also allows you to specify an examiner. On the right, the app displays\nthe minutiae markings of all the examiners who looked at the pair of prints (“Print”\ntab), or the minutiae markings of the specific examiner (“Examiner” tab), or the\nsummary of the analysis of the prints (“Summary” tab). In the Print and Examiner\ntabs, each point represents a minutiae marking by an examiner. Lines represent changes\nin their markings between stages of examination. Hexes represent the concentration\nof markings, where dark represents a higher concentration of markings in the area.\nThe Summary tab displays how many examiners looked at the pair of prints; which\npercentage of the examiners were correct, were inconclusive, changed minutiae markings;\nand the difficulty each examiner ranked the pair of prints.\nResults and Discussion\nAlthough moving minutiae can occur for a variety of reasons, imputation bias is\nstill prevalent when there are changes in minutiae. The concern with moving minutiae\nis that examiners could be doing so in order to confirm their preliminary conclusions.\nFor example, as shown by my app, examiners tend to move more minutiae in mated pairs,\nindicating that they may be changing more pre-marked minutiae from their first stage\nof examination in order to validate their individualization decisions. Additionally,\nexaminers who viewed the same latent print used in two different pairs have different\npreliminary markings, as well as different minutiae movements in the Comparison\nstage. This indicates that despite the use of the same latent print in both pairs,\nexaminers still mark different minutiae, and then choose to move them differently\nin the Comparison stage. The different minutiae movements indicates imputation bias,\nas they are choosing to move minutiae based on the exemplar print it is paired with.\nMany of the minutiae movement occur due to a lack of standardized procedure in the\nforensic fingerprint examination process. For example, more deletions might occur\nin the Comparison stage at an agency where there is a minimum minutiae requirement;\nexaminers might be unnecessarily marking minutiae in order to hit the minimum, and then\nlater deleting the ones that are not helpful. Imputation bias can lead to misidentifications,\nwhich can be very harmful in large, prominent criminal cases. Finally, as previous\npapers have mentioned, there should be a rigorously defined, standard forensic fingerprint\nexamination ACE-V process (Ulery et al., 2015). Many of the examiners, in the White\nBox study, stated that exclusions and inconclusive prints were more difficult when\nthey had to mark minutiae (which they were not required to do so in the Black Box\nstudy) (Ulery et al., 2015). This indicates that examiners do not necessarily have\nto mark minutiae in a standardized way. However, if they did, there might be more\ntransparency in the process, which is particularly important when errors occur.\nIn the studies, the consequences of making a false identification (or exclusion)\nare insignificant, but in true casework, the consequences could change many people’s\nlives for the worst.\nTerminology\nLatent print - An impression of the friction skin of the fingers or palms of the\nhands that has been transferred to another surface. These prints are typically lifted\nfrom crime scenes and are usually not of the highest quality.\nExemplar print - A print of the fingers and/or palms deliberately taken from an\nindividual for record-keeping purposes. Since these prints are collected under ideal\ncircumstances, they are usually high quality.\nMinutiae - Major features of a fingerprint image; they are used in the matching\nof fingerprints.\nMates - Two prints that came from the same source.\nNon-mates - Two prints that did not come from the same source.\nACE-V process - Method used to reach a determination on each print. ACE-V stands\nfor Analysis, Comparison, Evaluation, and Verification.\nAnalysis: The examiner assesses the latent print to determine if it\ncan be used for comparison. This step involves the preliminary assessment of\nseveral factors like the surface material, the substance of the print itself,\nand/or minutiae.\nComparison: The examiner is shown both the exemplar and a latent print.\nThe exemplar print may come from searching through the Automated Fingerprint Identification\nSystem (AFIS) or some other fingerprint database. The examiner analyses characteristic\nattributes of both prints and identifies conformities between the exemplar and\nthe latent prints.\nEvaluation: The examiner decides if the prints are from the same source\n(identification or individualization), different sources (exclusion), or are\ninconclusive.\nVerification: If an identification is made, the conclusion must be verified\nby another fingerprint examiner.\n\nReferences\nUlery, B. T., Hicklin, R. A., Buscaglia, J., and Roberts, M. A. (2011). Accuracy\nand reliability of forensic latent fingerprint decisions. Proceedings of the National\nAcademy of Sciences, 108(19):7733–7738.\nUlery, B. T., Hicklin, R. A., Roberts, M. A., and Buscaglia, J. (2014). Measuring\nwhat latent fingerprint examiners consider sufficient information for individualization\ndeterminations. PlOS ONE, 9(11):e110179.\nUlery, B. T., Hicklin, R. A., Roberts, M. A., and Buscaglia, J. (2015). Changes\nin latent fingerprint examiners’ markup between analysis and comparison. Forensic\nScience International, 247:54–61.\n\n\n\n",
    "preview": {},
    "last_modified": "2023-09-11T21:35:13-04:00",
    "input_file": {}
  }
]
